#include <stdio.h>
int main(void)
{
    int a[101][2], b[101][2], c[101][2];
    int i, j, m, n, cnt = 0;
    
    for (i = 0; i < 101; i++)        /* a表清零 */
    {
        for (j = 0; j < 2; j++)
        {
            a[i][j] = 0;
        }
    }

    for (i = 0; i < 101; i++)        /* b表清零 */
    {
        for (j = 0; j < 2; j++)
        {
            b[i][j] = 0;
        }
    }

    for (i = 0; i < 101; i++)        /* c表清零 */
    {
        for (j = 0; j < 2; j++)
        {
            c[i][j] = 0;
        }
    }

    do {
        scanf("%d %d", &m, &n);
        a[m][0] = m;
        c[m][0] = m;
        a[m][1] = n;
    } while (m != 0);        /* 输入a表，输入c表的第0列幂，不输入c表的第1列系数 */

    do {
        scanf("%d %d", &m, &n);
        b[m][0] = m;
        c[m][0] = m;
        b[m][1] = n;
    } while (m != 0);        /* 输入b表，输入c表的第0列幂，不输入c表的第1列系数 */

    for (i = 0, j = 1; i < 101; i++)        /* 统计c表的第1列系数 */
    {
        c[i][1] = a[i][1] + b[i][1];
    }

    for (i = 100; i > 1; i--)        /* 从c表的第100行开始循环，一直到第2行 */
    {
        if (c[i][1] != 0)        /* 只统计c表第1列系数不为0 */
        {
            if (c[i][1] == 1)        /* 如果c表第1列系数==1，比如40 1 */
            {
                if (cnt > 0)                /* 如果输出超过一次，记得前面加正号+ */
                {
                    printf("+");
                }
                printf("x%d", c[i][0]);        /* 输出x40 */
            }
            else if (c[i][1] == -1)        /* 如果c表第1列系数==-1，比如40 -1 */
            {
                printf("-x%d", c[i][0]);        /* 前面加负号-，系数-1省略，输出-x40 */
            }
            else        /* 其他情况，c表第1列系数不等于1，也不等于-1 */
            {
                if (c[i][1] < 0)
                {
                    printf("%dx%d", c[i][1], c[i][0]);        /* 系数小于0，直接输出 */
                }
                else
                {
                    if (cnt > 0)
                    {
                        printf("+");        /* 如果系数大于0，需要考虑是否第一次输出，不是第一次输出，需要前面加正号+ */
                    }
                    printf("%dx%d", c[i][1], c[i][0]);
                }
            }
            cnt++;
        }
    }

    if (c[1][1] != 0)        /* c表第1行第1列系数不等于0 */
    {
        {
            if (c[1][1] == 1)        /* 如果c表第1列系数==1 */
            {
                if (cnt > 0)
                {
                    printf("+");        /* 如果输出超过一次，记得前面加正号+ */
                }
                printf("x");
            }
            else if (c[1][1] == -1)        /* 如果c表第1列系数==-1 */
            {
                printf("-x");
            }
            else
            {
                if (a[1][1] > 0 && cnt > 0)        /* 如果系数大于0，需要考虑是否第一次输出，不是第一次输出，需要前面加正号+ */
                {
                    printf("+");        /* 如果输出超过一次，记得前面加正号+ */
                }
                printf("%dx", c[1][1]);
            }
            cnt++;
        }
    }

    if (c[0][1] != 0)
    {
        if (cnt > 0)
        {
            printf("+");        /* 如果系数大于0，需要考虑是否第一次输出，不是第一次输出，需要前面加正号+ */
        }
        printf("%d", c[0][1]);
        cnt++;
    }

    if (cnt == 0)
    {
        printf("0");
    }
}